Repository: Rask/wprsrv
Catalog: languages/wprsrv-*.po
Languages: fi

source: Reservations
fi: Varaukset

source: Export reservation data
fi: Vie varaustietoja

source: Export
fi: Vie

# export column
source: Reserver name
fi: Varaajan nimi

# export column
source: Reserver email
fi: Varaajan sähköposti

# export column
source: Date start
fi: Alkamispäivä

# export column
source: Date end
fi: Loppumispäivä

# export column
source: Date
fi: Päivämäärä

# export_column
source: Reservable ID
fi: Varauskohteen ID

# export column
source: Title
fi: Otsake

# export column
source: Description
fi: Lisätiedot

# export column
source: Status
fi: Tila

# export column
source: Reservable title
fi: Varauskohteen otsikko

source: The selected date range has no reservation data to export.
fi: Valitulla aikajaksolla ei ole vietäviä varaustietoja.

source: There was an error with the export, please try again.
fi: Vientitiedostoa luodessa tapahtui virhe, ole hyvä ja yritä uudestaan.

# calendar placeholder
source: To ...
fi: Loppuu ...

source: Format using YYYY-MM-DD
fi: Käytä VVVV-KK-PP -formaattia.

# calendar placeholder
source: From ...
fi: Alkaen ...

# reservation form honeypot failure
source: Invalid spam check, please validate your submission.
fi: Invalidi roskapostitarkistus, yritä uudelleen.

# reservation form field label
source: Your name
fi: Nimesi

# reservation form field label
source: Your email address
fi: Sähköpostiosoitteesi

# reservation form field label
source: Day to reserve
fi: Varattava päivä

# reservation form field label
source: Date range to reserve
fi: Varattava päivämääräväli

# reservation form field label
source: Additional information
fi: Lisätietoja

# reservation form error
source: The data you gave looked invalid, please check your fields and try again.
fi: Antamasi tiedot näyttivät puutteellisilta, ole hyvä ja tarkista syöttämäsi tiedot ja yritä uudestaan.

# reservation form error
source: Sorry, something went wrong in the reservation system, please try again.
fi: Pahoittelut, jotain meni mönkään varausjärjestelmässä. Ole hyvä ja yritä uudelleen.

# reservation form success
source: Thank you for your reservation. You will get a confirmation email in a few moments.
fi: Kiitoksia varauksestanne! Saatte pian vahvistussähköpostin.

# reservation form disabled for reservable
source: Reservations are disabled for this item at the moment.
fi: Varaukset tähän kohteeseen ovat tällä hetkellä pois käytöstä.

# reservation form disabled for guest users
source: Reservations are restricted to registered users. Please log in first.
fi: Varaukset tähän kohteeseen on rajattu kirjautuneille käyttäjille. Kirjaudu sisään tehdäksesi varauksen.

# pikaday calendars
source: Previous Month
fi: Edellinen kuukausi

# pikaday calendars
source: Next Month
fi: Seuraava kuukausi

# pikaday calendars
source: From &hellip;
fi: Alkaen &hellip;

# pikaday calendars
source: To &hellip;
fi: Loppuen &hellip;

# reservation form validation
source: You cannot reserve dates that are already reserved.
fi: Et voi varata päiviä, jotka ovat jo varattuja.

# validation error label
source: email address
fi: sähköpostiosoite

# validation error label
source: starting date or time
fi: alkamispäivä tai -aika

# validation error label
source: ending date or time
fi: loppumispäivä tai -aika

# validation error
source: Missing field: %s
fi: Puuttuva kenttä: %s

# validation error
source: Invalid number value for %s
fi: Vääränlainen numeroarvo kentälle %s

# validation error
source: Invalid date or time value for %s
fi: Vääränlainen päivä- tai aikamuoto kentälle %s

# validation error
source: Invalid email value for %s
fi: Vääränlainen sähköpostiosoite kentälle %s

# validation error
source: Given reservation date range contains a date that has already been reserved
fi: Annettu varausaikaväli sisältää päiviä, jotka ovat jo varattu

# post type labels
source: Reservables
fi: Varauskohteet

# post type labels
source: Reservable
fi: Varauskohde

# post type labels
source: Add new
fi: Lisää uusi

# post type labels
source: Add new reservable
fi: Lisää uusi varauskohde

# post type labels
source: Edit reservable
fi: Muokkaa varauskohdetta

# post type labels
source: New reservable
fi: Uusi varauskohde

# post type labels
source: Show reservable
fi: Näytä varauskohde

# post type labels
source: Find reservables
fi: Etsi varauskohteita

# post type labels
source: No reservables found
fi: Varauskohteita ei löytynyt

# post type labels
source: No reservables found in trash
fi: Varauskohteita ei löytynyt roskakorista

# reservable metabox title
source: Reservable settings
fi: Varauskohteen asetukset

# reservable metabox title
source: Reservation calendar
fi: Varauskalenteri

# reservable metabox title
source: Reservable actions
fi: Varauskohteen toiminnot

# post type labels
source: Reservations
fi: Varaukset

# post type labels
source: reservation
fi: Varaus

# post type labels
source: Add new reservation
fi: Lisää uusi varaus

# post type labels
source: Edit reservation
fi: Muokkaa varausta

# post type labels
source: New reservation
fi: Uusi varaus

# post type labels
source: Show reservation
fi: Näytä varaus

# post type labels
source: Find reservations
fi: Etsi varauksia

# post type labels
source: No reservations found
fi: Varauksia ei löytynyt

# post type labels
source: No reservations found in trash
fi: Varauksia ei löytynyt roskakorista

# post type rewrite slug
source: reservations
fi: varaukset

# metabox title
source: Reservation information
fi: Varaustiedot

# metabox title
source: Reservation actions
fi: Varaustoiminnot

# metabox title
source: Reservation notes
fi: Varauksen muistiinpanot

# metabox title
source: Publish
fi: Julkaise

source: Status
fi: Tila

source: Reserved item
fi: Varauskohde

# reservation admin column
source: No reservable determined
fi: Varauskohdetta ei ole määritelty

# post status
source: Pending reservation
fi: Odottava varaus

source: Pending reservations <span class='count'>(%s)</span>
fi: Odottavat varaukset <span class='count'>(%s)</span>

# post status
source: Accepted reservation
fi: Hyväksytty varaus

source: Accepted reservations <span class='count'>(%s)</span>
fi: Hyväksytyt varaukset <span class='count'>(%s)</span>

# post status
source: Declined reservation
fi: Hylätty varaus

source: Declined reservations <span class='count'>(%s)</span>
fi: Hylätyt varaukset <span class='count'>(%s)</span>

# note content for new pending reservation
source: Reservation marked as <em>pending</em>.
fi: Varaus merkittiin <em>odottavaksi</em>.

# note content for new accepted reservation
source: Reservation marked as <em>accepted</em>.
fi: Varaus merkittiin <em>hyväksytyksi</em>.

# note content for new declined reservation
source: Reservation marked as <em>declined</em>.
fi: Varaus merkittiin <em>hylätyksi</em>.

# reservation email
source: Your reservation has been accepted
fi: Varauksesi on hyväksytty

# reservation email
source: Your reservation has been declined
fi: Varauksesi on hylätty

# reservation email
source: You have a new pending reservation
fi: Sinulla on uusi odottava varaus

# reservation email
source: New pending reservation at %s
fi: Uusi odottava varaus sivustolla %s

# note content for new declined reservation
source: Reservation email notification failed. Attempted to send a `%s` email.
fi: Varauksen sähköposti-ilmoitus epäonnistui. Yritettiin lähettää`%s`-tyyppinen sähköposti.

# admin script localization
source: Previous month
fi: Edellinen kuukausi

# admin script localization
source: January
fi: Tammikuu

# admin script localization
source: February
fi: Helmikuu

# admin script localization
source: March
fi: Maaliskuu

# admin script localization
source: April
fi: Huhtikuu

# admin script localization
source: May
fi: Toukokuu

# admin script localization
source: June
fi: Kesäkuu

# admin script localization
source: July
fi: Heinäkuu

# admin script localization
source: August
fi: Elokuu

# admin script localization
source: September
fi: Syyskuu

# admin script localization
source: October
fi: Lokakuu

# admin script localization
source: November
fi: Marraskuu

# admin script localization
source: December
fi: Joulukuu

# admin script localization
source: Sunday
fi: Sunnuntai

# admin script localization
source: Monday
fi: Maanantai

# admin script localization
source: Tuesday
fi: Tiistai

# admin script localization
source: Wednesday
fi: Keskiviikko

# admin script localization
source: Thursday
fi: Torstai

# admin script localization
source: Friday
fi: Perjantai

# admin script localization
source: Saturday
fi: Lauantai

# admin script localization
source: Sun
fi: Su

# admin script localization
source: Mon
fi: Ma

# admin script localization
source: Tue
fi: Ti

# admin script localization
source: Wed
fi: Ke

# admin script localization
source: Thu
fi: To

# admin script localization
source: Fri
fi: Pe

# admin script localization
source: Sat
fi: La

source: YYYY-MM-DD
fi: VVVV-KK-PP

source: The calendar could not be generated, please refresh this page and try again.
fi: Kalenteria ei voitu generoida. Ole hyvä ja päivitä sivu ja yritä uudelleen.

source: Choose a reservable to export reservation data for. Currently only CSV exports are supported.
fi: Valitse varauskohde, jonka varaustiedot viedään. Tällä hetkellä vain CSV-vienti on tuettu.

source: There are not reservables with reservations available for exporting. Gather some reservations first!
fi: Yhdelläkään varauskohteella ei ole varauksia, joita voisi viedä. Kerää ensin varauksia!

source: Choose a reservable
fi: Valitse varauskohde

source: From date
fi: Alkaen

source: Use YYYY-MM-DD format. Reservations with ending dates earlier than this date will not be included.
fi: Käytä VVVV-KK-PP formaattia. Varaukset, joiden loppumispäivä on aikaisemmin kuin tämä päivämäärä eivät sisälly vientiin.

source: To date
fi: Loppuen

source: Use YYYY-MM-DD format. Reservations with starting dates later that this date will not be included.
fi: Käytä VVVV-KK-PP formaattia. Varaukset, joiden alkamispäivämäärä on myöhemmin kuin tämä päivämäärä eivät sisälly vientiin.

source: Flush cache
fi: Tyhjennä välimuisti

source: This reservable has no reservations.
fi: Tällä varauskohteella ei ole varauksia.

# reservable metabox form
source: Reservable active
fi: Varauskohde aktiivisena

source: If the reservable is not active, it will be visible in the frontend but no reservation form will be shown.
fi: Jos varauskohde ei ole aktiivisena, se näytetään julkisella sivustolla, mutta varauslomaketta ei näytetä.

source: Active
fi: Aktiivinen

# reservable metabox form
source: Only single-day reservations
fi: Vain yhden päivän varauksia

source: Disable date range selecting in the reservation form.
fi: Poista päivämääräväli käytöstä varauslomakkeessa.

source: Single day reservations
fi: Vain yhden päivän varaukset

# reservable metabox form
source: Only logged in users can reserve
fi: Vain kirjautuneet käyttäjät voivat varata

source: Disable reservations from guests.
fi: Älä anna vieraiden tehdä varauksia.

source: Require login
fi: Vaadi kirjautuminen

# reservable metabox form
source: Allow reservation overlaps
fi: Salli varausten limittymiset

source: Allow the reservable&rsquo;s reservations&rsquo; starting and ending dates to overlap. E.g. reservations end at 11:00 and a new reservation can begin at 16:00 at the same day.
fi: Salli varausten limittyminen alkamis- ja loppumispäivinä. Esim. jos edellinen varaus loppuu kello 11:00, seuraava varaus voi alkaa jo samana päivänä esim. kello 16:00.

source: Allow overlapping reservation days
fi: Salli limittyvät varauspäivät

# reservable metabox form
source: Disabled days
fi: Suljetut päivät

source: Choose dates when this reservable is not available for reservation. Dates are inclusive.
fi: Valitse päivämääriä, milloin tämä varauskohde ei ole varattavissa. Päivämäärävälit ovat sisällyttäviä.

# delete repeater row
source: Delete
fi: Poista

# add repeater row
source: Add
fi: Lisää

# reservable metabox form
source: Disabled weekdays
fi: Suljetut viikonpäivät

source: Choose the weekdays that should not be reservable.
fi: Valitse viikonpäivät, joita ei pysty varaamaan.

# actions metabox for reservation
source: If you want to decline this reservation, use this button. An email will be sent to the person who made this reservation, informing them of the declination.
fi: Jos haluat hylätä tämän varauksen, käytä tätä nappia. Varaajalle lähetetään sähköpostitse tieto hylkäämisestä.

# actions metabox for reservation
source: Decline reservation
fi: Hylkää varaus

# actions metabox for reservation
source: This reservation has already been declined.
fi: Tämä varaus on jo hylätty.

# actions metabox for reservation
source: If you want to approve this reservation, use this button. An email will be sent to the person who made this reservation, informing them about the accepted reservation.
fi: Jos haluat hyväksyä varauksen, käytä tätä nappia. Varaajalle lähetetään sähköpostitse tieto hyväksymisestä.

# actions metabox for reservation
source: Accept reservation
fi: Hyväksy varaus

# actions metabox for reservation
source: This reservation has already been accepted.
fi: Tämä varaus on jo hyväksytty.

# info metabox for reservation
source: Submitted at
fi: Lähetetty

# info metabox for reservation, post status
source: Status
fi: Tila

# info metabox for reservation
source: Reservation timespan
fi: Varauksen aikaväli

# info metabox for reservation
source: Reserved from %s to %s
fi: Varattu alkaen %s ja loppuen %s

# info metabox for reservation
source: Reserved item
fi: Varattu kohde

# info metabox for reservation
source: Description (from reserver)
fi: Lisätietoja (varaajalta)

source: Add a note
fi: Lisää muistiinpano

source: Add
fi: Lisää

source: No reservation notes available.
fi: Varausmuistiinpanoja ei ole saatavilla.

source: Notes (newest first)
fi: Muistiinpanot (uusin ensin)

# notes metabox for reservation, %s replaced with datetime
source: Note at %s
fi: Muistiinpano, %s

# reservation filters
source: All reservables
fi: Kaikki varauskohteet

# reservation frontend form
source: Make a reservation
fi: Tee varaus

# reservation frontend form
source: Submit reservation
fi: Lähetä varaus
